// Напишите программу, которая принимает на вход число и проверяет, кратно ли оно одновременно 7 и 23.

int a = 50 & 5;

if (a % 50 == 0 && a % 5 == 0)
{
    Console.WriteLine("Да");
}
else
{
    Console.WriteLine("Нет");
}
